alpha_0.55/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/




FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hill
    {
        type            wall;
        inGroups        1(wall);
        nFaces          564;
        startFace       36140;
    }
    top-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       36704;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          18135;
        startFace       36904;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          18135;
        startFace       55039;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          47;
        startFace       73174;
        matchTolerance  9.999999747e-05;
        transform       translational;
        neighbourPatch  cyclicAMI_inlet;
        separationVector ( -4.949999809 0 0 );
        lowWeightCorrection 0.009999999776;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          50;
        startFace       73221;
        matchTolerance  9.999999747e-05;
        transform       translational;
        neighbourPatch  cyclicAMI_outlet;
        separationVector ( 4.949999809 0 0 );
        lowWeightCorrection 0.009999999776;
    }
)

// ************************************************************************* //
